# Control-work
Прохождение1го блока обучения

Задача :
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решение не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами


Описание алгоритма решения:
Сначало объявляется два массива: изначальный и вторый такой же длины. Потом метод, в котором цикл соразмерный длине массива, внутри цикла проверка условия ( <=3 ), если да элемент первого массива заносится в count элемент второго массива. Переменная count чтобы поочередно закидывать из первого массива во второй и чтобы потом не было пробелов. После присвоения увеличивается переменная count на 1 и возвращается к циклу for в котором i увеличивается на 1. И так проверяется до конца.


Примеры:

["привет", "2", "мир", ":-)"] ---> ["2", ":-)"]
["1234", "1567", "-2", " информатика"] ---> ["-2"]
["Россия", "Дания", "Казань"] ---> []


1. Для начала рисуем блок-схему
информация об изображении (блок схема во вложении)

2. Пишем код на языке C# в Visual Studio Code
1. Задаем метод создания начального массива

string[] array 
2. Заполняем массив

"hello",
"2",
"world",
"1234",
"Eho",
"Alfa"
3. Создаем новую переменную, в которую записывается длина массива

var result = new string[array.Length]
4. Создаем счетчик

var newSize = 0
5. Задаем цикл

foreach (var value in array)
6. Задаем условие для цикла

if (value.Length <= 3)
{
    result[newSize] = value;
    newSize++;
}
7. Выводим результат на экран

Console.WriteLine(string.Join(Environment.NewLine, result, 0, newSize));
